RT-Thread/rt-thread/bsp/nxp/mcx/mcxn/Libraries/MCXN236/MCXN236/drivers/fsl_cmc.h
/*******************************************************************************
 * API
 ******************************************************************************/
#if defined(__cplusplus)
extern "C" {
#endif /* __cplusplus */

/*!
 * @name CLOCK mode configuration.
 * @{
 */

/*!
 * @brief Sets clock mode.
 *
 * This function configs the amount of clock gating when the core asserts
 * Sleeping due to WFI, WFE or SLEEPONEXIT.
 *
 * @param base CMC peripheral base address.
 * @param mode System clock mode.
 */
void CMC_SetClockMode(CMC_Type *base, cmc_clock_mode_t mode);

/*!
 * @brief Locks the clock mode setting.
 *
 * After invoking this function, any clock mode setting will be blocked.
 *
 * @param base CMC peripheral base address.
 */
static inline void CMC_LockClockModeSetting(CMC_Type *base)
{
    base->CKCTRL |= CMC_CKCTRL_LOCK_MASK;
}

/* @} */

/*!
 * @name Gets/Clears the Clock Mode, the wake up source, the Reset source.
 * @{
 */

/*!
 * @brief Gets the core clock gated status.
 *
 * This function get the status to indicate whether the core clock is gated.
 * The core clock gated status can be cleared by software.
 *
 * @param base CMC peripheral base address.
 * @return The status to indicate whether the core clock is gated.
 */
static inline cmc_core_clock_gate_status_t CMC_GetCoreClockGatedStatus(CMC_Type *base)
{
    return (cmc_core_clock_gate_status_t)(uint32_t)((base->CKSTAT & CMC_CKSTAT_VALID_MASK) >> CMC_CKSTAT_VALID_SHIFT);
}

/*!
 * @brief Clears the core clock gated status.
 *
 * This function clear clock status flag by software.
 *
 * @param base CMC peripheral base address.
 */
static inline void CMC_ClearCoreClockGatedStatus(CMC_Type *base)
{
    base->CKSTAT |= CMC_CKSTAT_VALID_MASK;
}

/*!
 * @brief Gets the Wakeup Source.
 *
 * This function gets the Wakeup sources from the previous low power mode entry.
 *
 * @param base CMC peripheral base address.
 * @return The Wakeup sources from the previous low power mode entry. See @ref _cmc_wakeup_sources for details.
 */
static inline uint8_t CMC_GetWakeupSource(CMC_Type *base)
{
    return ((uint8_t)((base->CKSTAT & CMC_CKSTAT_WAKEUP_MASK) >> CMC_CKSTAT_WAKEUP_SHIFT));
}

/*!
 * @brief Gets the Clock mode.
 *
 * This function gets the clock mode of the previous low power mode entry.
 *
 * @param base CMC peripheral base address.
 * @return The Low Power status.
 */
static inline cmc_clock_mode_t CMC_GetClockMode(CMC_Type *base)
{
    return (cmc_clock_mode_t)(uint32_t)((base->CKSTAT & CMC_CKSTAT_CKMODE_MASK) >> CMC_CKSTAT_CKMODE_SHIFT);
}

/*!
 * @brief Gets the System reset status.
 *
 * This function returns the system reset status. Those status
 * updates on every MAIN Warm Reset to indicate the type/source
 * of the most recent reset.
 *
 * @param base CMC peripheral base address.
 * @return The most recent system reset status. See @ref _cmc_system_reset_sources for details.
 */
static inline uint32_t CMC_GetSystemResetStatus(CMC_Type *base)
{
    return base->SRS;
}

/*!
 * @brief Gets the sticky system reset status since the last WAKE Cold Reset.
 *
 * This function gets all source of system reset that have generated a
 * system reset since the last WAKE Cold Reset, and that have not been
 * cleared by software.
 *
 * @param base CMC peripheral base address.
 * @return System reset status that have not been cleared by software. See @ref _cmc_system_reset_sources for details.
 */
static inline uint32_t CMC_GetStickySystemResetStatus(CMC_Type *base)
{
    return base->SSRS;
}

/*!
 * @brief Clears the sticky system reset status flags.
 *
 * @param base CMC peripheral base address.
 * @param mask Bitmap of the sticky system reset status to be cleared.
 */
static inline void CMC_ClearStickySystemResetStatus(CMC_Type *base, uint32_t mask)
{
    base->SSRS = mask;
}

#if (defined(FSL_FEATURE_MCX_CMC_HAS_RSTCNT_REG) && FSL_FEATURE_MCX_CMC_HAS_RSTCNT_REG)
/*!
 * @brief Gets the number of reset sequences completed since the last Cold Reset.
 *
 * @param base CMC peripheral base address.
 * @return The number of reset sequences.
 */
static inline uint8_t CMC_GetResetCount(CMC_Type *base)
{
    return (uint8_t)(base->RSTCNT & CMC_RSTCNT_COUNT_MASK);
}
#endif /* FSL_FEATURE_MCX_CMC_HAS_RSTCNT_REG */

/* @} */

/*!
 * @name Power mode configuration.
 * @{
 */

/*!
 * @brief Configures all power mode protection settings.
 *
 * This function configures the power mode protection settings for
 * supported power modes. This should be done before set the lowPower mode
 * for each power doamin.
 *
 * The allowed lowpower modes are passed as bit map. For example, to allow
 * Sleep and DeepSleep, use CMC_SetPowerModeProtection(CMC_base, kCMC_AllowSleepMode|kCMC_AllowDeepSleepMode).
 * To allow all low power modes, use CMC_SetPowerModeProtection(CMC_base, kCMC_AllowAllLowPowerModes).
 *
 * @param base CMC peripheral base address.
 * @param allowedModes Bitmaps of the allowed power modes. See @ref _cmc_power_mode_protection for details.
 */
void CMC_SetPowerModeProtection(CMC_Type *base, uint32_t allowedModes);

/*!
 * @brief Locks the power mode protection.
 *
 * This function locks the power mode protection. After invoking this function,
 * any power mode protection setting will be ignored.
 *
 * @param base CMC peripheral base address.
 */
static inline void CMC_LockPowerModeProtectionSetting(CMC_Type *base)
{
    base->PMPROT |= CMC_PMPROT_LOCK_MASK;
}

/*!
 * @brief Config the same lowPower mode for all power domain.
 *
 * This function configures the same low power mode for MAIN power domian and WAKE power domain.
 *
 * @param base CMC peripheral base address.
 * @param lowPowerMode The desired lowPower mode. See @ref cmc_low_power_mode_t for details.
 */
static inline void CMC_SetGlobalPowerMode(CMC_Type *base, cmc_low_power_mode_t lowPowerMode)
{
    base->GPMCTRL = CMC_GPMCTRL_LPMODE((uint8_t)lowPowerMode);
}

/*!
 * @brief Configures entry into low power mode for the MAIN Power domain.
 *
 * This function configures the low power mode for the MAIN power domian,
 * when the core executes WFI/WFE instruction. The available lowPower modes
 * are defined in the @ref cmc_low_power_mode_t.
 *
 * @param base CMC peripheral base address.
 * @param lowPowerMode The desired lowPower mode. See @ref cmc_low_power_mode_t for details.
 *
 */
static inline void CMC_SetMAINPowerMode(CMC_Type *base, cmc_low_power_mode_t lowPowerMode)
{
    base->PMCTRL[0] = CMC_PMCTRL_LPMODE((uint8_t)lowPowerMode);
}

/*!
 * @brief Gets the power mode of the MAIN Power domain.
 *
 * @param base CMC peripheral base address.
 * @return The power mode of MAIN Power domain. See @ref cmc_low_power_mode_t for details.
 */
static inline cmc_low_power_mode_t CMC_GetMAINPowerMode(CMC_Type *base)
{
    return (cmc_low_power_mode_t)(uint32_t)(base->PMCTRL[0] & CMC_PMCTRL_LPMODE_MASK);
}

#if (CMC_PMCTRL_COUNT > 1U)
/*!
 * @brief Configure entry into low power mode for the WAKE Power domain.
 *
 * This function configures the low power mode for the WAKE power domian,
 * when the core executes WFI/WFE instruction. The available lowPower mode
 * are defined in the @ref cmc_low_power_mode_t.
 *
 * @note The lowPower Mode for the WAKE domain must not be configured to a
 *       lower power mode than any other power domain.
 *
 * @param base CMC peripheral base address.
 * @param lowPowerMode The desired lowPower mode. See @ref cmc_low_power_mode_t for details.
 *
 */
static inline void CMC_SetWAKEPowerMode(CMC_Type *base, cmc_low_power_mode_t lowPowerMode)
{
    base->PMCTRL[1] = CMC_PMCTRL_LPMODE((uint8_t)lowPowerMode);
}

/*!
 * @brief Gets the power mode of the WAKE Power domain.
 *
 * @param base CMC peripheral base address.
 * @return The power mode of WAKE Power domain. See @ref cmc_low_power_mode_t for details.
 */
static inline cmc_low_power_mode_t CMC_GetWAKEPowerMode(CMC_Type *base)
{
    return (cmc_low_power_mode_t)(uint32_t)(base->PMCTRL[1] & CMC_PMCTRL_LPMODE_MASK);
}
#endif /* CMC_PMCTRL_COUNT > 1U */

/* @} */

/*!
 * @name Reset Pin configuration.
 * @{
 */

/*!
 * @brief Configure reset pin.
 *
 * This function configures reset pin. When enabled, the low power filter is enabled in both
 * Active and Low power modes, the reset filter is only enabled in Active mode. When both filers
 * are enabled, they operate in series.
 *
 * @param base CMC peripheral base address.
 * @param config Pointer to the reset pin config structure.
 */
void CMC_ConfigResetPin(CMC_Type *base, const cmc_reset_pin_config_t *config);

/* @} */

/*!
 * @name System Reset Interrupts.
 * @{
 */

/*!
 * @brief Enable system reset interrupts.
 *
 * This function enables the system reset interrupts. The assertion of
 * non-fatal warm reset can be delayed for 258 cycles of the 32K_CLK clock
 * while an enabled interrupt is generated. Then Software can perform a graceful
 * shutdown or abort the non-fatal warm reset provided the pending reset source is cleared
 * by resetting the reset source and then clearing the pending flag.
 *
 * @param base CMC peripheral base address.
 * @param mask System reset interrupts. See @ref _cmc_system_reset_interrupt_enable for details.
 *
 */
static inline void CMC_EnableSystemResetInterrupt(CMC_Type *base, uint32_t mask)
{
    base->SRIE |= mask;
}

/*!
 * @brief Disable system reset interrupts.
 *
 * This function disables the system reset interrupts.
 *
 * @param base CMC peripheral base address.
 * @param mask System reset interrupts. See @ref _cmc_system_reset_interrupt_enable for details.
 */
static inline void CMC_DisableSystemResetInterrupt(CMC_Type *base, uint32_t mask)
{
    base->SRIE &= (uint32_t)(~mask);
}

/*!
 * @brief Gets System Reset interrupt flags.
 *
 * This function returns the System reset interrupt flags.
 *
 * @param base CMC peripheral base address.
 * @return System reset interrupt flags. See @ref _cmc_system_reset_interrupt_flag for details.
 */
static inline uint32_t CMC_GetSystemResetInterruptFlags(CMC_Type *base)
{
    return base->SRIF;
}

/*!
 * @brief Clears System Reset interrupt flags.
 *
 * This function clears system reset interrupt flags. The pending reset source
 * can be cleared by resetting the source of the reset and then clearing the pending
 * flags.
 *
 * @param base CMC peripheral base address.
 * @param mask System Reset interrupt flags. See @ref _cmc_system_reset_interrupt_flag for details.
 *
 */
static inline void CMC_ClearSystemResetInterruptFlags(CMC_Type *base, uint32_t mask)
{
    base->SRIF = mask;
}

/* @} */

/*!
 * @name Non Maskable Pin interrupt.
 * @{
 */

/*!
 * @brief Enable/Disable Non maskable Pin interrupt.
 *
 * @param base CMC peripheral base address.
 * @param enable Enable or disable Non maskable pin interrupt.
 *          true    -   enable Non-maskable pin interrupt.
 *          false   -   disable Non-maskable pin interupt.
 */
static inline void CMC_EnableNonMaskablePinInterrupt(CMC_Type *base, bool enable)
{
    if (enable)
    {
        base->CORECTL |= CMC_CORECTL_NPIE_MASK;
    }
    else
    {
        base->CORECTL &= ~CMC_CORECTL_NPIE_MASK;
    }
}

/* @} */

/*!
 * @name Boot Configuration.
 * @{
 */

/*!
 * @brief Gets the logic state of the ISPMODE_n pin.
 *
 * This function returns the logic state of the ISPMODE_n pin
 * on the last negation of RESET_b pin.
 *
 * @param base CMC peripheral base address.
 * @return The logic state of the ISPMODE_n pin on the last negation of RESET_b pin.
 */
static inline uint8_t CMC_GetISPMODEPinLogic(CMC_Type *base)
{
    return (uint8_t)((base->MR[0] & CMC_MR_ISPMODE_n_MASK) >> CMC_MR_ISPMODE_n_SHIFT);
}

/*!
 * @brief Clears ISPMODE_n pin state.
 *
 * @param base CMC peripheral base address.
 */
static inline void CMC_ClearISPMODEPinLogic(CMC_Type *base)
{
    base->MR[0] = CMC_MR_ISPMODE_n_MASK;
}

/*!
 * @brief Set the logic state of the BOOT_CONFIGn pin.
 *
 * This function force the logic state of the Boot_Confign pin to assert
 * on next system reset.
 *
 * @param base CMC peripheral base address.
 * @param assert Assert the corresponding pin or not.
 *               true   -   Assert corresponding pin on next system reset.
 *               false  -   No effect.
 */
static inline void CMC_ForceBootConfiguration(CMC_Type *base, bool assert)
{
    if (assert)
    {
        base->FM[0] |= CMC_FM_FORCECFG_MASK;
    }
    else
    {
        base->FM[0] &= ~CMC_FM_FORCECFG_MASK;
    }
}

/* @} */

/*!
 * @name BootROM Status.
 * @{
 */

#if (defined(FSL_FEATURE_MCX_CMC_HAS_BSR_REG) && FSL_FEATURE_MCX_CMC_HAS_BSR_REG)
/*!
 * @brief Gets the status information written by the BootROM.
 *
 * @param base CMC peripheral base address.
 * @return The status information written by the BootROM.
 */
static inline uint32_t CMC_GetBootRomStatus(CMC_Type *base)
{
    return base->BSR;
}

/*!
 * @brief Sets the bootROM status value.
 *
 * @note This function is useful when result of CMC_CheckBootRomRegisterWrittable() is true.
 *
 * @param base CMC peripheral base address.
 * @param stat The state value to set.
 */
static inline void CMC_SetBootRomStatus(CMC_Type *base, uint32_t statValue)
{
    base->BSR = CMC_BSR_STAT(statValue);
}
#endif /* FSL_FEATURE_MCX_CMC_HAS_BSR_REG */

#if (defined(FSL_FEATURE_MCX_CMC_HAS_BLR_REG) && FSL_FEATURE_MCX_CMC_HAS_BLR_REG)
/*!
 * @brief Check if BootROM status and lock registers is writtable.
 *
 * @param base CMC peripheral base address.
 * @return The result of whether BootROM status and lock register is writtable.
 *      - \b true BootROM status and lock registers are writtable;
 *      - \b false BootROM status and lock registers are not writtable.
 */
static inline bool CMC_CheckBootRomRegisterWrittable(CMC_Type *base)
{
    return (base->BLR == 0x2UL);
}

/*!
 * @brief After invoking this function, BootROM status and lock registers cannot be written.
 *
 * @param base CMC peripheral base address.
 */
static inline void CMC_LockBootRomStatusWritten(CMC_Type *base)
{
    base->BLR = CMC_BLR_LOCK(0x5U);
}

/*!
 * @brief After invoking this function, BootROM status and lock register can be written.s
 *
 * @param base
 */
static inline void CMC_UnlockBootRomStatusWritten(CMC_Type *base)
{
    base->BLR = CMC_BLR_LOCK(0x2U);
}
#endif /* FSL_FEATURE_MCX_CMC_HAS_BLR_REG */

/* @} */

#if (defined(FSL_FEATURE_MCX_CMC_HAS_SRAM_DIS_REG) && FSL_FEATURE_MCX_CMC_HAS_SRAM_DIS_REG)
/*!
 * @name System SRAM Configuration.
 * @{
 */

/*!
 * @brief Power off the selected system SRAM always.
 *
 * This function power off the selected system SRAM always. The SRAM arrays should
 * not be accessed while they are shut down. SRAM array contents are not retained
 * if they are powered off.
 *
 * @param base CMC peripheral base address.
 * @param mask Bitmap of the SRAM arrays to be powered off all modes.
 *             See @ref _cmc_system_sram_arrays for details.
 *             Check Reference Manual for the SRAM region and mask bit relationship.
 */
void CMC_PowerOffSRAMAllMode(CMC_Type *base, uint32_t mask);

/*!
 * @brief Power on SRAM during all mode.
 *
 * @param base CMC peripheral base address.
 * @param mask Bitmap of the SRAM arrays to be powered on all modes.
 *             See @ref _cmc_system_sram_arrays for details.
 *             Check Reference Manual for the SRAM region and mask bit relationship.
 */
static inline void CMC_PowerOnSRAMAllMode(CMC_Type *base, uint32_t mask)
{
    base->SRAMDIS[0] &= CMC_SRAMDIS_DIS((uint32_t)(~mask));
}

/*!
 * @brief Power off the selected system SRAM during low power modes only.
 *
 * This function power off the selected system SRAM only during low power mode.
 * SRAM array contents are not retained if they are power off.
 *
 * @param base CMC peripheral base address.
 * @param mask Bitmap of the SRAM arrays to be power off during low power mode only.
 *             See @ref _cmc_system_sram_arrays for details.
 *             Check Reference Manual for the SRAM region and mask bit relationship.
 */
void CMC_PowerOffSRAMLowPowerOnly(CMC_Type *base, uint32_t mask);

/*!
 * @brief Power on the selected system SRAM during low power modes only.
 *
 * This function power on the selected system SRAM. The SRAM arrray contents are
 * retained in low power modes.
 *
 * @param base CMC peripheral base address.
 * @param mask Bitmap of the SRAM arrays to be power on during low power mode only.
 *              See @ref _cmc_system_sram_arrays for details.
 *              Check Reference Manual for the SRAM region and mask bit relationship.
 */
static inline void CMC_PowerOnSRAMLowPowerOnly(CMC_Type *base, uint32_t mask)
{
    base->SRAMRET[0] &= CMC_SRAMRET_RET((uint32_t)(~mask));
}

/* @} */
#endif /* FSL_FEATURE_MCX_CMC_HAS_SRAM_DIS_REG */

/*!
 * @name Flash Low Power Mode configuration.
 * @{
 */

#if (defined(FSL_FEATURE_MCX_CMC_HAS_NO_FLASHCR_WAKE) && FSL_FEATURE_MCX_CMC_HAS_NO_FLASHCR_WAKE)
/*!
 * @brief Configs the low power mode of the on-chip flash memory.
 *
 * This function configs the low power mode of the on-chip flash memory.
 *
 * @param base CMC peripheral base address.
 * @param doze true: Flash is disabled while core is sleeping
 *             false: No effect.
 * @param disable true: Flash memory is placed in low power state.
 *                false: No effect.
 */
void CMC_ConfigFlashMode(CMC_Type *base, bool doze, bool disable);
#else
/*!
 * @brief Configs the low power mode of the on-chip flash memory.
 *
 * This function configs the low power mode of the on-chip flash memory.
 *
 * @param base CMC peripheral base address.
 * @param wake true: Flash will exit low power state during the flash memory accesses.
 *             false: No effect.
 * @param doze true: Flash is disabled while core is sleeping
 *             false: No effect.
 * @param disable true: Flash memory is placed in low power state.
 *                false: No effect.
 */
void CMC_ConfigFlashMode(CMC_Type *base, bool wake, bool doze, bool disable);
#endif /* FSL_FEATURE_MCX_CMC_HAS_NO_FLASHCR_WAKE */
/* @} */

/*!
 * @name Debug Configuration.
 */

/*!
 * @brief Enables/Disables debug Operation when the core sleep.
 *
 * This function configs what happens to debug when core sleeps.
 *
 * @param base CMC peripheral base address.
 * @param enable Enable or disable Debug when Core is sleeping.
 *          true    -   Debug remains enabled when the core is sleeping.
 *          false   -   Debug is disabled when the core is sleeping.
 */
static inline void CMC_EnableDebugOperation(CMC_Type *base, bool enable)
{
    if (enable)
    {
        base->DBGCTL &= ~CMC_DBGCTL_SOD_MASK;
    }
    else
    {
        base->DBGCTL |= CMC_DBGCTL_SOD_MASK;
    }
}

/* @} */

/*!
 * @name Low Power modes enter.
 * @{
 */
/*!
 * @brief Prepares to enter low power modes.
 *
 * This function should be called before entering low power modes.
 *
 */
void CMC_PreEnterLowPowerMode(void);

/*!
 * @brief Recovers after wake up from low power modes.
 *
 * This function should be called after wake up from low power modes.
 * This function should be used with CMC_PreEnterLowPowerMode()
 *
 */
void CMC_PostExitLowPowerMode(void);

/*!
 * @brief Configs the entry into the same low power mode for each power domains.
 *
 * This function provides the feature to entry into the same low power mode for each power
 * domains. Before invoking this function, please ensure the selected power mode have been allowed.
 *
 * @param base CMC peripheral base address.
 * @param lowPowerMode The low power mode to be entered. See @ref cmc_low_power_mode_t for the details.
 *
 */
void CMC_GlobalEnterLowPowerMode(CMC_Type *base, cmc_low_power_mode_t lowPowerMode);

/*!
 * @brief Configs the entry into different low power modes for each power domains.
 *
 * This function provides the feature to entry into different low power modes for
 * each power domains. Before invoking this function please ensure the selected
 * modes are allowed.
 *
 * @param base CMC peripheral base address.
 * @param config Pointer to the cmc_power_domain_config_t structure.
 */
void CMC_EnterLowPowerMode(CMC_Type *base, const cmc_power_domain_config_t *config);

/* @} */

#if defined(__cplusplus)
}
#endif /* __cplusplus */

/*! @}*/
#endif /* FSL_CMC_H_ */
